app/views/feeds/favorites_list.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% else %>
    <h3> Poster par <%= User.find(favorie.user_id).name%></h3>