app/views/feeds/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    <%=link_to 'like', post_favorite_path(feed.id), class:'btn btn-info'%>
    <h3> Poster par <%= User.find(feed.user_id).name%></h3>