app/controllers/feeds_controller.rb

  def favorites_list
    @favorites=Feed.where(fovorite_of_user_id:current_user.id)
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."fovorite_of_user_id" IS NOT NULL

  def show
    @feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

 def make_it_as_my_favorite
    @feed=Feed.find params[:id]
    @feed.update(fovorite_of_user_id:current_user.id)
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "feeds" SET "fovorite_of_user_id" = $1, "updated_at" = $2 WHERE "feeds"."id" = $3  [["fovorite_of_user_id", 2], ["updated_at", "2021-07-17 15:21:30.372917"], ["id", 1]]

  def create
    @feed = Feed.new(feed_params)
    @feed.user_id=current_user.id
    respond_to do |format|
      if @feed.save
---
INSERT INTO "feeds" ("image", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "profil.jpg"], ["content", "jkjkl"], ["created_at", "2021-07-17 17:25:13.088904"], ["updated_at", "2021-07-17 17:25:13.088904"], ["user_id", 2]]

    def set_feed
      @feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]