app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @user= User.new(user_params)
      respond_to do |format|
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$12$/r5EOIDd9LRFkAH0TSuvYeXlbRE6qZlDv/FQIoZLPivbIWKMhSqEm"], ["image", "images.jpeg"], ["updated_at", "2021-07-17 09:40:17.153387"], ["id", 12]]
---
  def update
    @user=User.find(current_user.id)
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."user_id" = $1 LIMIT $2  [["user_id", 12], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @feed= Feed.find_by user_id: @user.id